# Exploratory Data Analysis of [Pizzeria Sales](https://www.kaggle.com/datasets/shilongzhuang/pizza-sales) using PostgreSQL
Inspiration: data analysis performed by [Github repository](https://github.com/Dnyanesh-NITW/pizza-sales-analysis-using-sql)  
Performed by [danicoder](twitter.com/chusk2)

In [ ]:
import pandas as pd
from sqlalchemy import create_engine

# Establish a connection to the PostgreSQL database

In [3]:
# Create an SQLAlchemy engine to connect to your PostgreSQL database
# Replace 'your_username', 'your_password', 'your_host', 'your_port', and 'your_database' with the appropriate values
conn = create_engine('postgresql://pizzas:pizzas@localhost:5432/pizzas')

Define a custom function to query the database:

In [4]:
def querydb(query, conn=conn):
    return pd.read_sql(query, conn)

### Total Revenue

In [5]:
querydb('''
select
	round(sum(o.quantity * p.unit_price)::numeric, 2)  as total_sales
from orders o
join pizza_prices p
on o.pizza_id=p.pizza_id and o.pizza_size = p.pizza_size ;
''', conn)

   total_sales
0    817860.05

### Average Order Value

In [6]:
querydb('''
select round(avg(s.total_order)::numeric, 2) as avg_oder_value from (
	select
		order_timestamp,
		sum(o.quantity * p.unit_price) as total_order
	from orders o
	join pizza_prices p
	on o.pizza_id=p.pizza_id and o.pizza_size = p.pizza_size
	group by 1
) s ;
''')

   avg_oder_value
0           38.31

### Total Pizza Sold

In [7]:
querydb('''
select sum(quantity) as total_pizzas_sold from orders o ;
''')

   total_pizzas_sold
0              49574

### Total Orders

In [8]:
querydb('''
select count(distinct order_timestamp) as total_number_orders from orders ;
''')

   total_number_orders
0                21350

### Average Pizzas Per Order

In [9]:
querydb('''
select round(avg(s.total_order)::numeric, 2) as avg_pizzas_per_order from (
 	select
 		order_timestamp,
 		sum(o.quantity) as total_order
 	from orders o
 	join pizza_prices p
 	on o.pizza_id=p.pizza_id and o.pizza_size = p.pizza_size
 	group by 1
) s ;
''')

   avg_pizzas_per_order
0                  2.32

## Sales Performance Analysis

### What is the average unit price and revenue of pizza across different categories?

In [10]:
querydb('''
select
	p.pizza_category,
	round(avg(pp.unit_price)::numeric, 2) as avg_pizza_price,
	round(avg(o.quantity * pp.unit_price)::numeric, 2) as avg_revenue
from orders o
join pizzas p using (pizza_id)
join pizza_prices pp using (pizza_id, pizza_size)
group by 1
order by 2 ;
''')

  pizza_category  avg_pizza_price  avg_revenue
0        classic            14.80        15.09
1         veggie            16.61        16.92
2        supreme            17.36        17.68
3        chicken            17.71        18.12

### What is the average unit price and revenue of pizza across different sizes?

In [11]:
querydb('''
select
	o.pizza_size,
	round(avg(pp.unit_price)::numeric, 2) as avg_pizza_price,
	round(avg(o.quantity * pp.unit_price)::numeric, 2) as avg_revenue
from orders o
join pizzas p using (pizza_id)
join pizza_prices pp using (pizza_id, pizza_size)
group by 1
order by 2 ;
''')

  pizza_size  avg_pizza_price  avg_revenue
0        S              12.36        12.60
1        M              15.95        16.21
2        L              19.80        20.26
3        XL             25.50        25.88
4        XXL            35.95        35.95

### What is the average unit price and revenue of most sold 3 pizzas?

In [12]:
querydb('''
select
	p.pizza_name,
	sum(o.quantity) as pizzas_sold,
	round(avg(pp.unit_price)::numeric, 2) as avg_pizza_price,
	round(avg(o.quantity * pp.unit_price)::numeric, 2) as avg_revenue
from orders o
join pizzas p using (pizza_id)
join pizza_prices pp using (pizza_id, pizza_size)
group by 1
order by 2 desc
limit 3 ;
''')

         pizza_name  pizzas_sold  avg_pizza_price  avg_revenue
0    classic deluxe         2453            15.58        15.80
1  barbecue chicken         2432            17.57        18.03
2          hawaiian         2422            13.32        13.62

## Seasonal Analysis

### Which days of the week have the highest number of orders?

In [13]:
querydb('''
select
	to_char(order_timestamp, 'Day') as weekday,
	sum(quantity) as pizzas_sold
from orders
group by 1
order by 2 desc ;
''')

     weekday  pizzas_sold
0  Friday            8242
1  Saturday          7493
2  Thursday          7478
3  Wednesday         6946
4  Tuesday           6895
5  Monday            6485
6  Sunday            6035

### At what time do most orders occur?

In [14]:
querydb('''
select
	extract(hour from order_timestamp)::integer as day_hour,
	sum(quantity) as pizzas_sold
from orders
group by 1
order by 2 desc ;
''')

    day_hour  pizzas_sold
0         12         6776
1         13         6413
2         18         5417
3         17         5211
4         19         4406
5         16         4239
6         14         3613
7         20         3534
8         15         3216
9         11         2728
10        21         2545
11        22         1386
12        23           68
13        10           18
14         9            4

### Which month has the highest revenue?

In [15]:
querydb('''
select
	to_char(o.order_timestamp, 'Month') as month,
	round(sum(o.quantity * pp.unit_price)::numeric, 2) as total_sales
from orders o
join pizza_prices pp using (pizza_id, pizza_size)
group by 1
order by 2 desc ;
''')

        month  total_sales
0   July          72557.90
1   May           71402.75
2   March         70397.10
3   November      70395.35
4   January       69793.30
5   April         68736.80
6   August        68278.25
7   June          68230.20
8   February      65159.60
9   December      64701.15
10  September     64180.05
11  October       64027.60

### Which season has the highest revenue?

In [16]:
querydb('''
select
	case
		WHEN lower(s.m) IN ('december', 'january', 'february') THEN 'Winter'
        WHEN lower(s.m) IN ('march', 'april', 'may') THEN 'Spring'
        WHEN lower(s.m) IN ('june', 'july', 'august') THEN 'Summer'
		WHEN lower(s.m) IN ('september', 'october', 'november') THEN 'Autumn'
	end as season,
	sum(s.total_sales) as season_sales
from (
	select
		-- the output of to_char has blank spaces at the end
		trim(to_char(o.order_timestamp, 'Month')) as m,
		round(sum(o.quantity * pp.unit_price)::numeric, 2) as total_sales
	from orders o
	join pizza_prices pp using (pizza_id, pizza_size)
	group by 1
	order by 1
	) s
group by 1
order by 2 desc ;
''')

   season  season_sales
0  Spring     210536.65
1  Summer     209066.35
2  Winter     199654.05
3  Autumn     198603.00

## Customer Behavior Analysis

### Which pizza is the favorite of customers (most ordered pizza)?

In [17]:
querydb('''
select
	p.pizza_name,
	sum(o.quantity) as total_pizzas_sold
from orders o
join pizzas p using (pizza_id)
group by 1
order by 2 desc
limit 1 ;
''')

       pizza_name  total_pizzas_sold
0  classic deluxe               2453

### Which pizza is ordered the most number of times?

In [18]:
querydb('''
select
	p.pizza_name,
	count(o.pizza_id) as times_ordered
from orders o
join pizzas p using (pizza_id)
group by 1
order by 2 desc
limit 1 ;
''')

       pizza_name  times_ordered
0  classic deluxe           2416

### Which pizza size is preferred by customers?

In [19]:
querydb('''
select
	o.pizza_size,
	count(o.pizza_size) as times_ordered
from orders o
group by 1
order by 2 desc
limit 1 ;
''')

  pizza_size  times_ordered
0        L            18526

### Which pizza category is preferred by customers?

In [20]:
querydb('''
select
	p.pizza_category,
	sum(o.quantity) as times_ordered
from orders o
join pizzas p using (pizza_id)
group by 1
order by 2 desc
limit 1 ;
''')

  pizza_category  times_ordered
0        classic          14888

## Pizza Analysis

### The pizza with the least price and highest price

In [21]:
querydb('''
with prices as (
	select
		p.pizza_name,
		pp.pizza_size,
		pp.unit_price as price
	from pizza_prices pp
	join pizzas p using (pizza_id)
)

select *
from prices
where prices.price in ( 
	-- cheapest pizza	
	(select min(price) from prices),
	-- most expensive pizza
	(select max(price) from prices)
	)
order by price ;
''')

  pizza_name pizza_size  price
0  pepperoni        S     9.75
1      greek        XXL  35.95

### Number of pizzas per category

In [22]:
querydb('''
select
	p.pizza_category,
	sum(o.quantity) as total_pizzas_sold
from orders o
join pizzas p using (pizza_id)
group by 1
order by 2 desc ;
''')

  pizza_category  total_pizzas_sold
0        classic              14888
1        supreme              11987
2         veggie              11649
3        chicken              11050

### Number of pizzas per size

In [23]:
querydb('''
select
	o.pizza_size,
	sum(o.quantity) as total_pizzas_sold
from orders o
group by 1
order by 2 desc ;
''')

  pizza_size  total_pizzas_sold
0        L                18956
1        M                15635
2        S                14403
3        XL                 552
4        XXL                 28

### Number of different pizzas in each category

In [24]:
querydb('''
select
	pizza_category,
	count(pizza_id) as total_pizzas
from pizzas
group by 1
order by 2 desc ;
''')

  pizza_category  total_pizzas
0        supreme             9
1         veggie             9
2        classic             8
3        chicken             6

### Pizzas with more than one category

In [25]:
querydb('''
select
	pizza_name,
	count(pizza_category) as total_pizzas
from pizzas
group by 1
having count(pizza_category) > 1
order by 2 desc ;
''')

Empty DataFrame
Columns: [pizza_name, total_pizzas]
Index: []

Each pizza belongs to only 1 category